public/2015/12/10/file_operate.html

        <!DOCTYPE HTML>
        <html>
        <head>
        <meta charset="utf-8">
        
        <title>StudyNotes</title>
        <meta name="author" content="FangQian">
        <meta name="description" content="Use OrgNote.">
        <meta property="og:site_name" content="StudyNotes"/>
        <meta name="Keywords" content="OrgNote,Emacs,org-mode,blog,python,geek">
        
        <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
        <meta property="og:image" content="undefined"/>

        <link href="/favicon.ico" rel="icon">
        
        <link rel="stylesheet" href="/theme/freemind/css/bootstrap.min.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/font-awesome.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/style.css" media="screen" type="text/css">
        <link rel="stylesheet" href="/theme/freemind/css/highlight.css" media="screen" type="text/css">
        </head>
        

        <body>  
        <nav id="main-nav" class="navbar navbar-inverse navbar-fixed-top" role="navigation">
        
        <div class="container">
        
        <button type="button" class="navbar-header navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
        <span class="sr-only">Toggle navigation</span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        <span class="icon-bar"></span>
        </button>
    
        <a class="navbar-brand" href="/index.html">StudyNotes</a>
        

        <div class="collapse navbar-collapse nav-menu">
        
        <ul class="nav navbar-nav">
        <li><a href="/public/minyi.html" title="归档"><i class="fa fa-sitemap"></i>MinYi</a></li><li><a href="/public/archive.html" title="归档"><i class="fa fa-archive"></i>归档</a></li><li><a href="/public/about.html" title="关于"><i class="fa fa-user"></i>关于</a></li>
        </ul>
        
        </div> <!-- navbar -->
        </div> <!-- container -->
        </nav>
        

        <div class="clearfix"></div>
        <div class="container">
        <div class="content">
        
        <div class="page-header">                   <!-- page-header begin -->
        <h1>文件的操作</h1>
        </div>                                      <!-- page-header end -->
        
        <div class="row page">                      <!-- row-page begin -->
        <div class="col-md-9">                      <!-- col-md-9 begin -->
        <div class="mypage">                        <!-- mypage begin -->
        
        <div class="slogan">                        <!-- slogan begin -->
        <i class="fa fa-heart"></i>
        标签: <a href="/public/tags/ShellScript.html"><i class="ShellScript"></i>ShellScript</a>
        </div>                                     <!-- slogan end -->
        
<div id="content">






<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 文件</a>
<ul>
<li><a href="#sec-1-1">1.1 列出文件</a></li>
<li><a href="#sec-1-2">1.2 文件类型(ALL is file   ——UNIX)</a></li>
<li><a href="#sec-1-3">1.3 文件的权限</a></li>
</ul>
</li>
<li><a href="#sec-2">2 查找文件</a>
<ul>
<li><a href="#sec-2-1">2.1 find命令及其语法</a></li>
<li><a href="#sec-2-2">2.2 find命令:路径，测试</a></li>
<li><a href="#sec-2-3">2.3 find命令: 使用!运算符对测试求反</a></li>
<li><a href="#sec-2-4">2.4 find命令:action</a></li>
</ul>
</li>
<li><a href="#sec-3">3 比较文件</a>
<ul>
<li><a href="#sec-3-1">3.1 使用comm比较文件</a></li>
<li><a href="#sec-3-2">3.2 使用diff比较文件</a></li>
</ul>
</li>
<li><a href="#sec-4">4 比较描述符</a></li>
<li><a href="#sec-5">5 重定向</a>
<ul>
<li><a href="#sec-5-1">5.1 输出重定向(覆盖)</a></li>
<li><a href="#sec-5-2">5.2 输出重定向(追加)</a></li>
<li><a href="#sec-5-3">5.3 输入重定向</a></li>
<li><a href="#sec-5-4">5.4 当前文档</a></li>
<li><a href="#sec-5-5">5.5 重定向两个文件描述符</a></li>
<li><a href="#sec-5-6">5.6 使用exec命令分配文件描述符</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 文件</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 列出文件</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="example">ls [option]... [file]...   #参考Shell手册
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 文件类型(ALL is file   ——UNIX)</h3>
<div class="outline-text-3" id="text-1-2">

<p>1.普通文件。在ls -l命令中，普通文件的第一列的第一个字符是连字符-
2.目录。　　目录的作用是组织和访问其它文件。
3.伪文件。　如键盘，鼠标等。。。
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 文件的权限</h3>
<div class="outline-text-3" id="text-1-3">

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 查找文件</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> find命令及其语法</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="example">find path test action
</pre>

<p>
其中,path表示要搜索的路径，test表示测试条件，用户可以同时指定多个路径和多个测试条件，路径和测试条件之间用空格隔开。
action表示对于搜索结果要执行的操作。
</p>
<p>
find命令的工作流程如下:
(1)搜索所有指定的路径，包括所有的子目录。
</p>
<p>
(2)对于遇到的每个文件，检查是否符合用户指定的条件。在该步骤中,所有符合条件的文件形成一个列表。
</p>
<p>
(3)对于结果列表中的每个文件，执行用户指定的操作。
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> find命令:路径，测试</h3>
<div class="outline-text-3" id="text-2-2">

<p>1.通常情况下，路径都是一个目录名，可以用相对路径，绝对路径，以及简写形式来指定路径
2.一些简单的测试条件(详细的参考Shell手册)
</p><ul>
<li>-name pattern   表示包含指定匹配模式的文件名
</li>
<li>-iname pattern  表示包含指定匹配模式的文件名，此条件不区分大小写
</li>
<li>-type           指定文件类型，可以取f和d这两个值,分别表示普通文件和目录
</li>
<li>-perm mode      匹配其权限被设置为指定mode的文件
</li>
<li>user userid     匹配其所有者为指定用户ID的文件
</li>
</ul>

<p>&hellip;
参数太多，感觉find好强大啊。。。
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> find命令: 使用!运算符对测试求反</h3>
<div class="outline-text-3" id="text-2-3">

<p>!两边必须留空格，且用单引号或者用反斜线引用。
</p></div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> find命令:action</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>-print              默认动作，将搜索结果写入到标准输出
</li>
<li>-fprint file        与-print相同，但是将搜索结果写入到文件file
</li>
<li>-ls                 以详细格式(长格式)显示搜索结果
</li>
<li>-fls file           同-ls，但是将搜索结果写入到文件file
</li>
<li>-delete             将搜索到的文件删除
</li>
<li>-exec command{}\;   查找并执行命令，{}表示搜索到的文件名
</li>
<li>-ok command{}\;     查找并执行命令,但是要用户确认
</li>
</ul>




<pre class="example">'command' {} \;
command表示Shell命令,大括号{}表示搜索结果中的文件名，最后的分号(需要转义，与大括号有个空格)表示命令的结束。
</pre>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 比较文件</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 使用comm比较文件</h3>
<div class="outline-text-3" id="text-3-1">

<p>comm命令的作用是逐行比较两个有序的文件，其语法如下:
</p>


<pre class="example">comm [option]... file file2
</pre>

<p>
其中,option表示comm命令的有关选项。常用的选项有:
</p><ul>
<li>-1    不显示第一个文件中独有的文本行
</li>
<li>-2    不显示第二个文件中独有的文本行
</li>
<li>-3    不显示两个文件中共同的文本行
</li>
<li>&ndash;check-order    检查参与比较的两个文件是否已经排序
</li>
<li>&ndash;nocheck-order  不检查参与比较的两个文件是否已经排序
</li>
</ul>

<p>默认情况下，comm命令会输出３列，分别为第一个文件独有的文本行,第二个文件独有的文本行，以及两个文件公共的文本行。
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 使用diff比较文件</h3>
<div class="outline-text-3" id="text-3-2">

<p>diff命令功能也是逐行比较多个文件的内容。与comm不同的是，diff命令并不要求参与比较的文件都是有序的。另外，
diff不仅可以比较普通文件，而且还可以比较多个目录的内容的差异。基本语法如下:
</p>


<pre class="example">diff [option]... files
</pre>

<p>
其中，option表示命令选项。diff命令的选项主要是用来控制输出的格式，常用的选项如下:
</p><ul>
<li>-c    输出包含上下文环境的格式。
</li>
<li>-u    以统一格式显示文件的不同。
</li>
<li>-y    以并列的方式显示文件的异同之处。
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 比较描述符</h2>
<div class="outline-text-2" id="text-4">

<p>1.什么是文件描述符
</p>
<p>
  从形式上讲，文件描述符是一个非整数。实际上，它是一个索引值，指向内核为每个进程所维护的该进程打开文件的记录表。当程序打开
一个现有的现有文件或者创建一个新文件时，内核向进程返回一个文件描述符。
</p>
<p>
　文件描述符从０开始，其最大值与当前系统中可以打开的最大文件数有关。文件描述符是由无符号整数表示的句柄，进程使用它来标识打开的
文件。
</p>
<p>
2.标准输入、标准输出和标准错误
</p>
<p>
　标准输入的文件描述符为0,表示默认的输入文件，即Shell需要执行命令的来源。
</p>
<p>
　标准输出的文件描述符为1,表示默认的输出文件，即显示Shell命令的执行结果的地方。
</p>
<p>
　标准错误的文件描述符为２，标准Shell命令的错误消息输出的地方。
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 重定向</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 输出重定向(覆盖)</h3>
<div class="outline-text-3" id="text-5-1">

<p>输出重定向是指将原本输出到标准输出的数据输出到其它文件或者设备中。输出重定向的操作符为大于号&gt;，基本语法如下:
</p>


<pre class="example">cmd &gt; file
</pre>

<p>
上面的语法中,cmd表示Shell命令，大于号&gt;为从定向操作符，file表示重定向的目标文件。
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 输出重定向(追加)</h3>
<div class="outline-text-3" id="text-5-2">




<pre class="example">cmd [n]&gt;&gt; file  #n为文件描述符
</pre>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 输入重定向</h3>
<div class="outline-text-3" id="text-5-3">

<p>从文件中获取输入，这种输入的机制为输入重定向。
</p>


<pre class="example">cmd &lt; file
</pre>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 当前文档</h3>
<div class="outline-text-3" id="text-5-4">

<p>输入重定向另外一个用途就是生成当前文档(here documents)。当前文档主要用在命令行中需要多行输入的情况。语法如下:
</p>


<pre class="example">cmd &lt;&lt; delimiter
document
delimiter     #自定义的分隔符，不能含有空格或者制表符
</pre>

</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 重定向两个文件描述符</h3>
<div class="outline-text-3" id="text-5-5">




<pre class="example">n&gt;&amp;m
</pre>

<p>
n和m都是文件描述符。当n=1,且m=2时，文件描述符1成为文件描述符2的副本，所有的标准输出都被重定向到标准错误；
当n=2,m=1时，文件描述符2成为描述符1的副本，所以所有的标准错误都被重定向到标准输出。当n=1时，可以省略。
</p></div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 使用exec命令分配文件描述符</h3>
<div class="outline-text-3" id="text-5-6">

</div>
</div>
</div>
</div>


            <div>
            <center>
            <div class="pagination">
            <ul class="pagination">
            <li class="prev"><a href="/public/2015/12/14/html_css.html" class=alignright prev"><i class="fa fa-arrow-circle-o-left"></i>上一页</a></li>
            <li><a href="/public/archive.html" target="_blank"><i class="fa fa-archive"></i>Archive</a></li>
            <li class="next"><a href="/public/2015/12/03/SQL_Base.html" class="alignright next">下一页<i class="fa fa-arrow-circle-o-right"></i></a></li>
            </ul>
            </div>
            </center>
            </div>
            
            </div> <!-- my-page --></div> <!-- col-md -->

        <div class="col-md-3">
        <div id="sidebar">
        
        <div class="widget">
        <h4>最新文章</h4>
        <ul class="entry list-unstyled">
        <li><a href="/public/2016/03/23/urllib2.html"><i class="fa fa-file-o"></i>Python标准库urllib2的使用细节</a></li><li><a href="/public/2016/02/29/redis.html"><i class="fa fa-file-o"></i>Redis基础</a></li><li><a href="/public/2016/02/24/WTForms.html"><i class="fa fa-file-o"></i>WTForms</a></li><li><a href="/public/2016/02/02/easy_install.html"><i class="fa fa-file-o"></i>easy_install</a></li><li><a href="/public/2015/11/14/pythonbase.html"><i class="fa fa-file-o"></i>Python基础知识</a></li><li><a href="/public/2015/11/13/simplecommand.html"><i class="fa fa-file-o"></i>简单的Linux命令</a></li>
        </ul>   
        </div> 
        
        <div class="widget">
        <h4>标签云</h4>
        <ul class="tag_box inline list-unstyled">
        <li><a href="/public/tags/默认.html">默认<span>1</span></a></li><li><a href="/public/tags/Redis.html">Redis<span>1</span></a></li><li><a href="/public/tags/Flask.html">Flask<span>1</span></a></li><li><a href="/public/tags/python.html">python<span>1</span></a></li><li><a href="/public/tags/Python.html">Python<span>3</span></a></li><li><a href="/public/tags/Linux.html">Linux<span>5</span></a></li><li><a href="/public/tags/HTML&amp;CSS.html">HTML&amp;CSS<span>1</span></a></li><li><a href="/public/tags/ShellScript.html">ShellScript<span>2</span></a></li><li><a href="/public/tags/MySQL.html">MySQL<span>2</span></a></li><li><a href="/public/tags/随笔.html">随笔<span>1</span></a></li>
        </ul>
        </div>
        
        <div class="widget">
        <h4>时间机器</h4>
        <ul class="tag_box inline list-unstyled">
        <li><a href="/public/tags/201603.html">201603<span>1</span></a></li><li><a href="/public/tags/201602.html">201602<span>3</span></a></li><li><a href="/public/tags/201512.html">201512<span>6</span></a></li><li><a href="/public/tags/201511.html">201511<span>6</span></a></li><li><a href="/public/tags/201412.html">201412<span>1</span></a></li><li><a href="/public/tags/201411.html">201411<span>1</span></a></li><li><a href="/public/archive.html">All<span>18</span></a></li>
        </ul>
        </div>
        
        <div class="widget">
        <h4>快速链接</h4>
        <ul class="entry list-unstyled">
        
            <li><a href="http://lesliezhu.github.com" title="Leslie Zhu" target="_blank"><i class="fa fa-github"></i>Leslie Zhu</a></li>
            
            <li><a href="http://code.activestate.com/recipes/langs/python" title="Python-Cookbook" target="_blank"><i class="fa fa-github"></i>Python-Cookbook</a></li>
            
            <li><a href="https://github.com/LeslieZhu/OrgNote" title="OrgNote" target="_blank"><i class="fa fa-github"></i>OrgNote</a></li>
            
        </ul>
        </div>
        
        </div> <!-- sidebar -->
        </div> <!-- col-md-3 -->
        

        </div> <!-- row-fluid -->
        </div>
        </div>
        

        <div class="container-narrow">
        <footer>
        <p>&copy; 2014 FangQian
        with help from <a href="https://github.com/LeslieZhu/OrgNote" target="_blank">OrgNote</a>. Theme by <a href="https://github.com/LeslieZhu/orgnote-theme-freemind">orgnote-theme-freemind</a>.  Published with GitHub Pages. 
        </p> </footer>
        </div> <!-- container-narrow -->
        
        <a id="gotop" href="#">   
        <span>▲</span> 
        </a>
        
        </body>
        </html>
        
